set_property BITSTREAM.GENERAL.COMPRESS True [current_design]
set_property CFGBVS VCCO [current_design]
set_property CONFIG_VOLTAGE 3.3 [current_design]

set_property IOSTANDARD LVCMOS33 [get_ports MDIO_PHY_*]
set_property IOSTANDARD LVCMOS33 [get_ports RGMII_*]
set_property IOSTANDARD LVDS_25 [get_ports ADC0_CLK_*]
set_property IOSTANDARD LVDS_25 [get_ports ADC1_CLK_*]
set_property IOSTANDARD LVDS_25 [get_ports ADC0_OUT_*]
set_property IOSTANDARD LVDS_25 [get_ports ADC1_OUT_*]
set_property IOSTANDARD LVDS_25 [get_ports DAC_D_*]
set_property IOSTANDARD LVDS_25 [get_ports DAC_DCI_*]
set_property IOSTANDARD LVDS_25 [get_ports DAC_DCO_*]

create_clock -period 8.000 -name RGMII_rxc -waveform {0.000 4.000} [get_ports RGMII_rxc]
create_clock -period 8.000 -name RGMII_txc -waveform {0.000 4.000} [get_ports RGMII_txc]
create_clock -period 8.138 -name ADC1_CLK -waveform {0.000 4.069} [get_ports ADC1_CLK_clk_p]
set_input_jitter ADC1_CLK 0.1
create_clock -period 8.138 -name DAC_DCO -waveform {0.000 4.069} [get_ports DAC_DCO_P]
#False path constraints to async inputs coming directly to synchronizer
set_false_path -to [get_pins -hier -filter {name =~ *idelayctrl_reset_gen/*reset_sync*/PRE }]
set_false_path -to [get_pins -of [get_cells -hier -filter { name =~ *i_MANAGEMENT/SYNC_*/data_sync* }] -filter { name =~ *D }]
set_false_path -to [get_pins -hier -filter {name =~ *reset_sync*/PRE }]
#False path constraints from Control Register outputs
set_false_path -from [get_pins -hier -filter {name =~ *i_MANAGEMENT/DUPLEX_MODE_REG*/C }]
# constraint valid if parameter C_EXTERNAL_CLOCK = 0
set_case_analysis 0 [get_pins -hier -filter {name =~ *i_bufgmux_gmii_clk/CE0}]
set_case_analysis 0 [get_pins -hier -filter {name =~ *i_bufgmux_gmii_clk/S0}]
set_case_analysis 1 [get_pins -hier -filter {name =~ *i_bufgmux_gmii_clk/CE1}]
set_case_analysis 1 [get_pins -hier -filter {name =~ *i_bufgmux_gmii_clk/S1}]
# Use these constraints to modify input delay on RGMII signals
set_input_delay -clock [get_clocks RGMII_rxc] -max -1.500 [get_ports {{RGMII_rd[*]} RGMII_rx_ctl}]
set_input_delay -clock [get_clocks RGMII_rxc] -min -2.800 [get_ports {{RGMII_rd[*]} RGMII_rx_ctl}]
set_input_delay -clock [get_clocks RGMII_rxc] -clock_fall -max -add_delay -1.500 [get_ports {{RGMII_rd[*]} RGMII_rx_ctl}]
set_input_delay -clock [get_clocks RGMII_rxc] -clock_fall -min -add_delay -2.800 [get_ports {{RGMII_rd[*]} RGMII_rx_ctl}]
# Use these constraints to modify output delay on RGMII signals if 2ns delay is added by the core
set_output_delay -clock [get_clocks RGMII_txc] -max 0.750 [get_ports {{RGMII_td[*]} RGMII_tx_ctl}]
set_output_delay -clock [get_clocks RGMII_txc] -min -0.700 [get_ports {{RGMII_td[*]} RGMII_tx_ctl}]
set_output_delay -clock [get_clocks RGMII_txc] -clock_fall -max -add_delay 0.750 [get_ports {{RGMII_td[*]} RGMII_tx_ctl}]
set_output_delay -clock [get_clocks RGMII_txc] -clock_fall -min -add_delay -0.700 [get_ports {{RGMII_td[*]} RGMII_tx_ctl}]

set_property PACKAGE_PIN AB2 [get_ports MDIO_PHY_mdc]
set_property PACKAGE_PIN Y4 [get_ports MDIO_PHY_mdio_io]
set_property PACKAGE_PIN AB6 [get_ports {RGMII_rd[0]}]
set_property PACKAGE_PIN AB7 [get_ports {RGMII_rd[1]}]
set_property PACKAGE_PIN Y11 [get_ports {RGMII_rd[2]}]
set_property PACKAGE_PIN AB9 [get_ports {RGMII_rd[3]}]
set_property PACKAGE_PIN AB5 [get_ports RGMII_rx_ctl]
set_property PACKAGE_PIN AA7 [get_ports RGMII_rxc]
set_property -dict {PACKAGE_PIN Y5 SLEW FAST} [get_ports {RGMII_td[0]}]
set_property -dict {PACKAGE_PIN AA12 SLEW FAST} [get_ports {RGMII_td[1]}]
set_property -dict {PACKAGE_PIN AB12 SLEW FAST} [get_ports {RGMII_td[2]}]
set_property -dict {PACKAGE_PIN AB11 SLEW FAST} [get_ports {RGMII_td[3]}]
set_property -dict {PACKAGE_PIN AB10 SLEW FAST} [get_ports RGMII_tx_ctl]
set_property -dict {PACKAGE_PIN AA11 SLEW FAST} [get_ports RGMII_txc]
set_property PACKAGE_PIN AB1 [get_ports ENET0_EXT_INTIN]

set_property IOSTANDARD LVCMOS33 [get_ports ENET0_EXT_INTIN]

set_property PACKAGE_PIN M19 [get_ports ADC0_CLK_clk_p]
set_property PACKAGE_PIN M20 [get_ports ADC0_CLK_clk_n]
set_property PACKAGE_PIN B19 [get_ports ADC1_CLK_clk_p]
set_property PACKAGE_PIN B20 [get_ports ADC1_CLK_clk_n]
#set_input_delay -clock [get_clocks ADC1_CLK] -max 4.000  [get_ports {ADC1_OUT_P[*]}]
#set_input_delay -clock [get_clocks ADC1_CLK] -min -4.000 [get_ports {ADC1_OUT_P[*]}]
#set_output_delay -clock [get_clocks DAC_DCO] -max 3.500 [get_ports {DAC_D_P[*]}]
#set_output_delay -clock [get_clocks DAC_DCO] -min -3.500 [get_ports {DAC_D_P[*]}]

set_property PACKAGE_PIN K19 [get_ports {ADC0_OUT_P[0]}]
set_property PACKAGE_PIN J18 [get_ports {ADC0_OUT_P[1]}]
set_property PACKAGE_PIN L17 [get_ports {ADC0_OUT_P[2]}]
set_property PACKAGE_PIN J15 [get_ports {ADC0_OUT_P[3]}]
set_property PACKAGE_PIN J16 [get_ports {ADC0_OUT_P[4]}]
set_property PACKAGE_PIN J21 [get_ports {ADC0_OUT_P[5]}]
set_property PACKAGE_PIN L21 [get_ports {ADC0_OUT_P[6]}]
set_property PACKAGE_PIN M21 [get_ports {ADC0_OUT_P[7]}]
set_property PACKAGE_PIN N22 [get_ports {ADC0_OUT_P[8]}]
set_property PACKAGE_PIN L18 [get_ports {ADC0_OUT_P[9]}]
set_property PACKAGE_PIN J20 [get_ports {ADC0_OUT_P[10]}]
set_property PACKAGE_PIN M15 [get_ports {ADC0_OUT_P[11]}]
set_property PACKAGE_PIN N17 [get_ports {ADC0_OUT_P[12]}]
set_property PACKAGE_PIN P17 [get_ports {ADC0_OUT_P[13]}]
set_property PACKAGE_PIN P20 [get_ports {ADC0_OUT_P[14]}]
set_property PACKAGE_PIN R20 [get_ports {ADC0_OUT_P[15]}]
set_property PACKAGE_PIN D18 [get_ports {ADC1_OUT_P[0]}]
set_property PACKAGE_PIN C17 [get_ports {ADC1_OUT_P[1]}]
set_property PACKAGE_PIN D16 [get_ports {ADC1_OUT_P[2]}]
set_property PACKAGE_PIN C15 [get_ports {ADC1_OUT_P[3]}]
set_property PACKAGE_PIN B16 [get_ports {ADC1_OUT_P[4]}]
set_property PACKAGE_PIN A16 [get_ports {ADC1_OUT_P[5]}]
set_property PACKAGE_PIN A18 [get_ports {ADC1_OUT_P[6]}]
set_property PACKAGE_PIN A21 [get_ports {ADC1_OUT_P[7]}]
set_property PACKAGE_PIN B21 [get_ports {ADC1_OUT_P[8]}]
set_property PACKAGE_PIN D22 [get_ports {ADC1_OUT_P[9]}]
set_property PACKAGE_PIN E21 [get_ports {ADC1_OUT_P[10]}]
set_property PACKAGE_PIN F21 [get_ports {ADC1_OUT_P[11]}]
set_property PACKAGE_PIN D20 [get_ports {ADC1_OUT_P[12]}]
set_property PACKAGE_PIN H22 [get_ports {ADC1_OUT_P[13]}]
set_property PACKAGE_PIN E19 [get_ports {ADC1_OUT_P[14]}]
set_property PACKAGE_PIN F18 [get_ports {ADC1_OUT_P[15]}]

set_property PACKAGE_PIN V18 [get_ports {DAC_D_P[0]}]
set_property PACKAGE_PIN Y14 [get_ports {DAC_D_P[1]}]
set_property PACKAGE_PIN U15 [get_ports {DAC_D_P[2]}]
set_property PACKAGE_PIN W20 [get_ports {DAC_D_P[3]}]
set_property PACKAGE_PIN Y13 [get_ports {DAC_D_P[4]}]
set_property PACKAGE_PIN U17 [get_ports {DAC_D_P[5]}]
set_property PACKAGE_PIN AB14 [get_ports {DAC_D_P[6]}]
set_property PACKAGE_PIN AA16 [get_ports {DAC_D_P[7]}]
set_property PACKAGE_PIN AA17 [get_ports {DAC_D_P[8]}]
set_property PACKAGE_PIN AB19 [get_ports {DAC_D_P[9]}]
set_property PACKAGE_PIN AA21 [get_ports {DAC_D_P[10]}]
set_property PACKAGE_PIN U20 [get_ports {DAC_D_P[11]}]
set_property PACKAGE_PIN T21 [get_ports {DAC_D_P[12]}]
set_property PACKAGE_PIN AA22 [get_ports {DAC_D_P[13]}]
set_property PACKAGE_PIN V22 [get_ports {DAC_D_P[14]}]
set_property PACKAGE_PIN T22 [get_ports {DAC_D_P[15]}]
set_property PACKAGE_PIN Y19 [get_ports DAC_DCO_P]
set_property PACKAGE_PIN W16 [get_ports DAC_DCI_P]

set_property -dict {PACKAGE_PIN Y9 IOSTANDARD LVCMOS33} [get_ports i2s_mclk]
set_property -dict {PACKAGE_PIN AA4 IOSTANDARD LVCMOS33} [get_ports i2s_bclk]
set_property -dict {PACKAGE_PIN Y6 IOSTANDARD LVCMOS33} [get_ports i2s_wclk]
set_property -dict {PACKAGE_PIN W5 IOSTANDARD LVCMOS33} [get_ports i2s_dout]
set_property -dict {PACKAGE_PIN W6 IOSTANDARD LVCMOS33} [get_ports i2s_din]
set_property -dict {PACKAGE_PIN AB4 IOSTANDARD LVCMOS33} [get_ports uart_rtl_0_txd]
set_property -dict {PACKAGE_PIN AA6 IOSTANDARD LVCMOS33} [get_ports uart_rtl_0_rxd]
set_property -dict {PACKAGE_PIN Y8 IOSTANDARD LVCMOS33} [get_ports uart_rtl_1_rxd]
set_property -dict {PACKAGE_PIN W7 IOSTANDARD LVCMOS33} [get_ports uart_rtl_1_txd]
set_property -dict {PACKAGE_PIN V5 IOSTANDARD LVCMOS33} [get_ports TX_ON]
set_property -dict {PACKAGE_PIN V7 IOSTANDARD LVCMOS33} [get_ports TX_FAIL]
set_property -dict {PACKAGE_PIN T16 IOSTANDARD LVCMOS25} [get_ports DEBUG_UART]
set_property -dict {PACKAGE_PIN V9 IOSTANDARD LVCMOS33} [get_ports PTT]
set_property -dict {PACKAGE_PIN V8 IOSTANDARD LVCMOS33} [get_ports CW_KEY]
set_property -dict {PACKAGE_PIN W8 IOSTANDARD LVCMOS33} [get_ports CAT_DTR]
set_property -dict {PACKAGE_PIN U10 IOSTANDARD LVCMOS33} [get_ports CAT_RTC]

set_property -dict {PACKAGE_PIN R18 IOSTANDARD LVDS_25} [get_ports RF_CLOCKOUT_P]
set_property -dict {PACKAGE_PIN T18 IOSTANDARD LVDS_25} [get_ports RF_CLOCKOUT_N]
set_property -dict {PACKAGE_PIN V13 IOSTANDARD LVDS_25} [get_ports RF_DATAOUT_P]
set_property -dict {PACKAGE_PIN W13 IOSTANDARD LVDS_25} [get_ports RF_DATAOUT_N]

